In [2]:
import pandas as pd
import numpy as np

In [3]:
import pandas as pd
dataFrame = pd.DataFrame({'col1':['A']*3 + ['B']*4 + ['C','B','A'], 'col2': [2,3,4,2,4,2,1,3,4,4]})

In [4]:
dataFrame

  col1  col2
0    A     2
1    A     3
2    A     4
3    B     2
4    B     4
5    B     2
6    B     1
7    C     3
8    B     4
9    A     4

In [6]:
dataFrame

  col1  col2
0    A     2
1    A     3
2    A     4
3    B     2
4    B     4
5    B     2
6    B     1
7    C     3
8    B     4
9    A     4

In [7]:
l = []  
p = [l.append(i) for i in dataFrame.col2 if i not in l]
    #if i not in l: 
     #    l.append(i)
#print(l)

In [8]:
l

[2, 3, 4, 1]

In [9]:
dataFrame.drop_duplicates()

  col1  col2
0    A     2
1    A     3
2    A     4
3    B     2
4    B     4
6    B     1
7    C     3

In [10]:

Dframe = pd.DataFrame([ [1,2,3,np.nan,4],[2,np.nan,5,6,4], [np.nan,7,np.nan,9,6] ])
Dframe

     0    1    2    3  4
0  1.0  2.0  3.0  NaN  4
1  2.0  NaN  5.0  6.0  4
2  NaN  7.0  NaN  9.0  6

In [11]:
Dframe.isnull()

       0      1      2      3      4
0  False  False  False   True  False
1  False   True  False  False  False
2   True  False   True  False  False

In [12]:
for i in Dframe:
    if i == Dframe.isna:
        Dframe=99

In [13]:
Dframe.replace(to_replace=np.nan, value=99,)

      0     1     2     3  4
0   1.0   2.0   3.0  99.0  4
1   2.0  99.0   5.0   6.0  4
2  99.0   7.0  99.0   9.0  6

In [14]:
Dframe = pd.DataFrame({ 'key': ['x','x','y','y','z'],'x':np.arange(5) , 'y': [3,4,5,6,7] })
#Report the mean of  column x and y grouped by key column

In [15]:
Dframe.mean()

x    2.0
y    5.0
dtype: float64

In [16]:
import smtplib as s

ob=s.SMTP("smtp.gmail.com",587)

ob.starttls()

ob.login("ramkunwarboo@gmail.com", "ram@1234")

subject = "Sendin email using Python"
body = "python email sending"

message = "Subject:{}\n\n{}".format(subject,body)

listofaddress = ["ramkunwarboo@gmail.com"]

ob.sendmail("ramkunwarboo@gmail.com", listofaddress,message)

print("send successfully....")

ob.quit()

send successfully....

(221, b'2.0.0 closing connection i20sm12122758pfq.35 - gsmtp')